rkz/extension/Documents/ПроизводствоБезЗаказа.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ПроизводствоБезЗаказа</Name>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>МатериалыИРаботы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>НомерГруппыЗатрат</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>КоличествоУпаковок</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВыходныеИзделия</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>НомерГруппыЗатрат</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

rkz/extension/Documents/ПроизводствоБезЗаказа/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

&После("ДобавитьКомандыПечати")
Процедура бит_ДобавитьКомандыПечати(КомандыПечати)
	
	// {{ПервыйБИТ ЛистТребований [ЛТ6.1.5] [ASHolyavko@1cbit.ru] [29.10.2025] +        
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "ЗаданиеДляПроизводстваБезСпецификации";
	КомандаПечати.Представление = НСтр("ru = '(бит) Задание для производства без спецификации'");  
	
	// }}ПервыйБИТ ЛистТребований [ЛТ6.1.5] [ASHolyavko@1cbit.ru] [29.10.2025] -
	
КонецПроцедуры

&Перед("Печать")
Процедура бит_Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода)
	
	// {{ПервыйБИТ ЛистТребований [ЛТ6.1.5] [ASHolyavko@1cbit.ru] [29.10.2025] +        
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ЗаданиеДляПроизводстваБезСпецификации") Тогда
		
		Заголовок = НСтр("ru = '(бит) Задание для производства без спецификации'");
		МодульУправлениеПечатью = ОбщегоНазначения.ОбщийМодуль("УправлениеПечатью");
		МодульУправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
			КоллекцияПечатныхФорм,
			"ЗаданиеДляПроизводстваБезСпецификации", 
			Заголовок,
			СформироватьПечатнуюФормуЗаданиеДляПроизводстваБезСпецификации(МассивОбъектов),
			,
			"Документ.бит_ЗаданиеДляПроизводстваБезСпецификации.ЗаданиеДляПроизводстваБезСпецификации");
		
	КонецЕсли; 
	
	// }}ПервыйБИТ ЛистТребований [ЛТ6.1.5] [ASHolyavko@1cbit.ru] [29.10.2025] -
	
КонецПроцедуры

Функция СформироватьПечатнуюФормуЗаданиеДляПроизводстваБезСпецификации(МассивОбъектов)
	
	// {{ПервыйБИТ ЛистТребований [ЛТ6.1.5] [ASHolyavko@1cbit.ru] [29.10.2025] +        
	
	УстановитьПривилегированныйРежим(Истина);  
	ПараметрыПечати = ИСТИНА;
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.АвтоМасштаб = Истина;
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	
	ТабличныйДокумент.КлючПараметровПечати = "ЗаданиеДляПроизводстваБезСпецификации";
	
	Макет = ПолучитьМакет("бит_ЗаданиеДляПроизводстваБезСпецификации");
	
	Для Каждого ЭлМассива Из МассивОбъектов Цикл
		
		ОбластьЗаголовок = Макет.ПолучитьОбласть("ОбластьЗаголовок");
		ОбластьВыходноеИзделие = Макет.ПолучитьОбласть("ОбластьВыходноеИзделие");
		ОбластьКомментарий = Макет.ПолучитьОбласть("ОбластьКомментарий");
		ОбластьГруппаМатериалов = Макет.ПолучитьОбласть("ОбластьГруппаМатериалов");
		//ОбластьМатериалы = Макет.ПолучитьОбласть("ОбластьМатериалы");
		ОбластьИтого = Макет.ПолучитьОбласть("ОбластьИтого");
		ОбластьИтогоМатериалов = Макет.ПолучитьОбласть("ОбластьИтогоМатериалов");
		
		ОбластьЗаголовок.Параметры.НачальникСмены = ЭлМассива.Ответственный;
		ОбластьЗаголовок.Параметры.Дата = Формат(ЭлМассива.Дата, "ДФ=dd.MM.yyyy");
		
		Если ТипЗнч(ЭлМассива.бит_Исполнитель) = Тип("СправочникСсылка.Бригады") Тогда
			
			Исполнитель = "";
			
			Для Каждого СтрокаТЧ Из ЭлМассива.бит_СоставБригады Цикл
				
				Исполнитель = Исполнитель + ?(ЗначениеЗаполнено(Исполнитель),", ","") + СтрокаТЧ.Сотрудник.Наименование;
				ОбластьЗаголовок.Параметры.Исполнитель = Исполнитель;
				
			КонецЦикла;
			
		Иначе
			ОбластьЗаголовок.Параметры.Исполнитель = ЭлМассива.бит_Исполнитель;	
		КонецЕсли;	
		
		ОбластьЗаголовок.Параметры.Оборудование = ЭлМассива.бит_Оборудование.бит_КодВРЦ;
		
		ТабличныйДокумент.Вывести(ОбластьЗаголовок);      
		
		Для Каждого СтрокаТЧ Из ЭлМассива.ВыходныеИзделия Цикл
		
			ОбластьВыходноеИзделие.Параметры.ВыходноеИзделие = СтрокаТЧ.Номенклатура;
			ОбластьВыходноеИзделие.Параметры.ПлановоеКоличество = СтрокаТЧ.КоличествоУпаковок;
			ОбластьВыходноеИзделие.Параметры.Вес = СтрокаТЧ.Номенклатура.ВесЗнаменатель * СтрокаТЧ.КоличествоУпаковок;
			Если  ЭлМассива.Трудозатраты.Количество() <> 0 Тогда
				ОбластьВыходноеИзделие.Параметры.НормаВремени = ЭлМассива.Трудозатраты[0].ВидРабот.бит_ВремяВыполнения * СтрокаТЧ.КоличествоУпаковок;
			КонецЕсли;
			ОбластьВыходноеИзделие.Параметры.ФактическоеКоличество = СтрокаТЧ.КоличествоУпаковок;
			
			ТабличныйДокумент.Вывести(ОбластьВыходноеИзделие);
			
			ОбластьКомментарий.Параметры.Комментарий = ?(ЗначениеЗаполнено(СтрокаТЧ.Назначение), СтрокаТЧ.Назначение.Комментарий + " ", "")
				+ ?(ЗначениеЗаполнено(ЭлМассива.Комментарий), ЭлМассива.Комментарий, "");
			
			ТабличныйДокумент.Вывести(ОбластьКомментарий);

			
		КонецЦикла;	
	
		//ОбластьВнеплановаяОперация = Макет.ПолучитьОбласть("ОбластьВнеплановаяОперация");
		
				
		//ТабличныйДокумент.Вывести(ОбластьВыходноеИзделие);
		//ТабличныйДокумент.Вывести(ОбластьКомментарий);
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПроизводствоБезЗаказаМатериалыИРаботы.Номенклатура КАК Номенклатура,
		|	СУММА(ПроизводствоБезЗаказаМатериалыИРаботы.КоличествоУпаковок) КАК КоличествоУпаковок,
		|	ПроизводствоБезЗаказаВыходныеИзделия.Номенклатура КАК ГруппаЗатрат
		|ИЗ
		|	Документ.ПроизводствоБезЗаказа.МатериалыИРаботы КАК ПроизводствоБезЗаказаМатериалыИРаботы
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПроизводствоБезЗаказа.ВыходныеИзделия КАК ПроизводствоБезЗаказаВыходныеИзделия
		|		ПО ПроизводствоБезЗаказаМатериалыИРаботы.Ссылка = ПроизводствоБезЗаказаВыходныеИзделия.Ссылка
		|			И ПроизводствоБезЗаказаМатериалыИРаботы.НомерГруппыЗатрат = ПроизводствоБезЗаказаВыходныеИзделия.НомерГруппыЗатрат
		|ГДЕ
		|	ПроизводствоБезЗаказаВыходныеИзделия.Ссылка = &Ссылка
		|	И ПроизводствоБезЗаказаМатериалыИРаботы.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	ПроизводствоБезЗаказаМатериалыИРаботы.Номенклатура,
		|	ПроизводствоБезЗаказаВыходныеИзделия.Номенклатура
		|ИТОГИ ПО
		|	ГруппаЗатрат";
		
		Запрос.УстановитьПараметр("Ссылка", ЭлМассива);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаГруппаЗатрат = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаГруппаЗатрат.Следующий() Цикл
			
			ОбластьГруппаМатериалов.Параметры.ГруппаМатериалов = ВыборкаГруппаЗатрат.ГруппаЗатрат;
			
			ТабличныйДокумент.Вывести(ОбластьГруппаМатериалов);
			
			ВыборкаДетальныеЗаписи = ВыборкаГруппаЗатрат.Выбрать();
			
			н = 0;
			
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				
				Если н = 0 Тогда
					ОбластьМатериалы = Макет.ПолучитьОбласть("ОбластьМатериалы");
				КонецЕсли;
				
				н = н + 1;
							
				Если н = 1 Тогда	
					ОбластьМатериалы.Параметры.Материал1 = ВыборкаДетальныеЗаписи.Номенклатура;
					ОбластьМатериалы.Параметры.Количество1 = ВыборкаДетальныеЗаписи.КоличествоУпаковок;
				Иначе
					ОбластьМатериалы.Параметры.Материал2 = ВыборкаДетальныеЗаписи.Номенклатура;
					ОбластьМатериалы.Параметры.Количество2 = ВыборкаДетальныеЗаписи.КоличествоУпаковок;	
				КонецЕсли;
			
				Если н = 2 Тогда
					ТабличныйДокумент.Вывести(ОбластьМатериалы);
					н = 0;
				КонецЕсли;
				
			КонецЦикла;
			
			Если н = 1 Тогда
				ТабличныйДокумент.Вывести(ОбластьМатериалы);
			КонецЕсли;
			
		КонецЦикла;
				
		//ТабличныйДокумент.Вывести(ОбластьГруппаМатериалов);
		//ТабличныйДокумент.Вывести(ОбластьМатериалы);
		ТабличныйДокумент.Вывести(ОбластьИтого);
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПроизводствоБезЗаказаМатериалыИРаботы.Номенклатура КАК Номенклатура,
		|	СУММА(ПроизводствоБезЗаказаМатериалыИРаботы.КоличествоУпаковок) КАК КоличествоУпаковок
		|ИЗ
		|	Документ.ПроизводствоБезЗаказа.МатериалыИРаботы КАК ПроизводствоБезЗаказаМатериалыИРаботы
		|ГДЕ
		|	ПроизводствоБезЗаказаМатериалыИРаботы.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	ПроизводствоБезЗаказаМатериалыИРаботы.Номенклатура";
		
		Запрос.УстановитьПараметр("Ссылка", ЭлМассива);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		//ТабличныйДокумент.Вывести(ОбластьИтогоМатериалов);
		
		н = 0;
			
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Если н = 0 Тогда
				ОбластьМатериалы = Макет.ПолучитьОбласть("ОбластьМатериалы");
			КонецЕсли;
			
			н = н + 1;
			
			Если н = 1 Тогда	
				ОбластьМатериалы.Параметры.Материал1 = ВыборкаДетальныеЗаписи.Номенклатура;
				ОбластьМатериалы.Параметры.Количество1 = ВыборкаДетальныеЗаписи.КоличествоУпаковок;
			Иначе
				ОбластьМатериалы.Параметры.Материал2 = ВыборкаДетальныеЗаписи.Номенклатура;
				ОбластьМатериалы.Параметры.Количество2 = ВыборкаДетальныеЗаписи.КоличествоУпаковок;	
			КонецЕсли;
			
			Если н = 2 Тогда
				ТабличныйДокумент.Вывести(ОбластьМатериалы);
				н = 0;
			КонецЕсли;	
		КонецЦикла;
		
		Если н = 1 Тогда
			ТабличныйДокумент.Вывести(ОбластьМатериалы);
		КонецЕсли;		
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПроизводствоБезЗаказа.Ссылка КАК Ссылка,
		|	ТехнологическиеОперации.бит_КодОперации.Наименование КАК НомерОперации,
		|	ТехнологическиеОперации.бит_КодОперации.НаименованиеОперации КАК НаименованиеОперации,
		|	ТехнологическиеОперации.Ссылка КАК ТехнологическаяОперация
		|ИЗ
		|	Документ.ПроизводствоБезЗаказа КАК ПроизводствоБезЗаказа
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ТехнологическиеОперации КАК ТехнологическиеОперации
		|		ПО (ТехнологическиеОперации.бит_КодОперации.ВнеплановаяОперация)
		|			И ПроизводствоБезЗаказа.бит_Оборудование = ТехнологическиеОперации.РабочийЦентр
		|ГДЕ
		|	ПроизводствоБезЗаказа.Ссылка = &СсылкаНаОбъект";
		
		Запрос.УстановитьПараметр("СсылкаНаОбъект", ЭлМассива);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ТехнологическаяОперация) Тогда
				
				ОбластьВнеплановаяОперация = Макет.ПолучитьОбласть("ОбластьВнеплановаяОперация");
				ОбластьВнеплановаяОперация.Параметры.Наименование = Строка(ВыборкаДетальныеЗаписи.НомерОперации) + " " + Строка(ВыборкаДетальныеЗаписи.НаименованиеОперации);
				
				Эталон = Обработки.ПечатьЭтикетокИЦенников.ПолучитьМакет("Эталон");
				РисунокКвадрат = Эталон.Рисунки.Квадрат100Пикселей; // РисунокТабличногоДокумента
				КоличествоМиллиметровВПикселе = РисунокКвадрат.Высота / 100;
				
				ПараметрыШтрихкода = ГенерацияШтрихкода.ПараметрыГенерацииШтрихкода();
				ПараметрыШтрихкода.Ширина           = Окр(ОбластьВнеплановаяОперация.Рисунки.КартинкаШтрихкода1.Ширина / КоличествоМиллиметровВПикселе);
				ПараметрыШтрихкода.Высота           = Окр(ОбластьВнеплановаяОперация.Рисунки.КартинкаШтрихкода1.Высота / КоличествоМиллиметровВПикселе);
				ПараметрыШтрихкода.Штрихкод         = ВыборкаДетальныеЗаписи.НомерОперации;//СокрЛП(ШтрихкодированиеПечатныхФорм.ЧисловойКодПоСсылке(ВыборкаДетальныеЗаписи.НомерОперации));
				ПараметрыШтрихкода.ТипВходныхДанных = 0; // Штрихкод - это строка
				ПараметрыШтрихкода.ТипКода          = 4; // Code128
				ПараметрыШтрихкода.ОтображатьТекст  = Ложь;
				ПараметрыШтрихкода.РазмерШрифта     = 6;
				ПараметрыШтрихкода.Масштабировать   = Истина;
				
				ОбластьВнеплановаяОперация.Рисунки.КартинкаШтрихкода1.Картинка = ГенерацияШтрихкода.ИзображениеШтрихкода(ПараметрыШтрихкода).Картинка;
				
				ТабличныйДокумент.Вывести(ОбластьВнеплановаяОперация);
				
			КонецЕсли;
			
		КонецЦикла;
		
		ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		
	КонецЦикла;
	
	
	Возврат ТабличныйДокумент;
	
	// }}ПервыйБИТ ЛистТребований [ЛТ6.1.5] [ASHolyavko@1cbit.ru] [29.10.2025] -
	
КонецФункции

#КонецЕсли
